* Prints predefined message	
	IDENTIFICATION DIVISION.
	PROGRAM-ID. PreDefMsg.
	AUTHOR. gangagoura.
	DATA DIVISION.	
	WORKING-STORAGE SECTION.
	01 PreDefMsg	PIC X(18) VALUE 'Hello Cobol World!'.
	
	PROCEDURE DIVISION.
	DISPLAY PreDefMsg.
	STOP RUN.
